lib/xml/createOutboundCampaign.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ser="http://service.admin.ws.five9.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:createOutboundCampaign>
            <!--Optional:-->
            <campaign>
                <!--Optional:-->
                <description>?</description>
                <!--Optional:-->
                <mode>?</mode>
                <!--Optional:-->
                <name>?</name>
                <!--Optional:-->
                <profileName>?</profileName>
                <!--Optional:-->
                <state>?</state>
                <!--Optional:-->
                <trainingMode>?</trainingMode>
                <!--Optional:-->
                <type>?</type>
                <!--Optional:-->
                <autoRecord>?</autoRecord>
                <!--Optional:-->
                <callWrapup>
                    <!--Optional:-->
                    <agentNotReady>?</agentNotReady>
                    <!--Optional:-->
                    <dispostionName>?</dispostionName>
                    <!--Optional:-->
                    <enabled>?</enabled>
                    <!--Optional:-->
                    <reasonCodeName>?</reasonCodeName>
                    <!--Optional:-->
                    <timeout>
                        <days>?</days>
                        <hours>?</hours>
                        <minutes>?</minutes>
                        <seconds>?</seconds>
                    </timeout>
                </callWrapup>
                <!--Optional:-->
                <ftpHost>?</ftpHost>
                <!--Optional:-->
                <ftpPassword>?</ftpPassword>
                <!--Optional:-->
                <ftpUser>?</ftpUser>
                <!--Optional:-->
                <recordingNameAsSid>?</recordingNameAsSid>
                <!--Optional:-->
                <useFtp>?</useFtp>
                <!--Optional:-->
                <analyzeLevel>?</analyzeLevel>
                <!--Optional:-->
                <CRMRedialTimeout>
                    <days>?</days>
                    <hours>?</hours>
                    <minutes>?</minutes>
                    <seconds>?</seconds>
                </CRMRedialTimeout>
                <!--Optional:-->
                <dnisAsAni>?</dnisAsAni>
                <!--Optional:-->
                <enableListDialingRatios>?</enableListDialingRatios>
                <!--Optional:-->
                <listDialingMode>?</listDialingMode>
                <!--Optional:-->
                <noOutOfNumbersAlert>?</noOutOfNumbersAlert>
                <!--Optional:-->
                <stateDialingRule>?</stateDialingRule>
                <!--Optional:-->
                <timeZoneAssignment>?</timeZoneAssignment>
                <!--Optional:-->
                <actionOnAnswerMachine>
                    <!--Optional:-->
                    <actionArgument>?</actionArgument>
                    <!--Optional:-->
                    <actionType>?</actionType>
                    <!--Optional:-->
                    <maxWaitTime>
                        <days>?</days>
                        <hours>?</hours>
                        <minutes>?</minutes>
                        <seconds>?</seconds>
                    </maxWaitTime>
                </actionOnAnswerMachine>
                <!--Optional:-->
                <actionOnQueueExpiration>
                    <!--Optional:-->
                    <actionArgument>?</actionArgument>
                    <!--Optional:-->
                    <actionType>?</actionType>
                    <!--Optional:-->
                    <maxWaitTime>
                        <days>?</days>
                        <hours>?</hours>
                        <minutes>?</minutes>
                        <seconds>?</seconds>
                    </maxWaitTime>
                </actionOnQueueExpiration>
                <!--Optional:-->
                <callAnalysisMode>?</callAnalysisMode>
                <!--Optional:-->
                <callsAgentRatio>?</callsAgentRatio>
                <!--Optional:-->
                <dialNumberOnTimeout>?</dialNumberOnTimeout>
                <!--Optional:-->
                <dialingMode>?</dialingMode>
                <!--Optional:-->
                <dialingPriority>?</dialingPriority>
                <!--Optional:-->
                <dialingRatio>?</dialingRatio>
                <!--Optional:-->
                <distributionAlgorithm>?</distributionAlgorithm>
                <!--Optional:-->
                <distributionTimeFrame>?</distributionTimeFrame>
                <!--Optional:-->
                <limitPreviewTime>?</limitPreviewTime>
                <!--Optional:-->
                <maxDroppedCallsPercentage>?</maxDroppedCallsPercentage>
                <!--Optional:-->
                <maxPreviewTime>
                    <days>?</days>
                    <hours>?</hours>
                    <minutes>?</minutes>
                    <seconds>?</seconds>
                </maxPreviewTime>
                <!--Optional:-->
                <maxQueueTime>
                    <days>?</days>
                    <hours>?</hours>
                    <minutes>?</minutes>
                    <seconds>?</seconds>
                </maxQueueTime>
                <!--Optional:-->
                <monitorDroppedCalls>?</monitorDroppedCalls>
                <!--Optional:-->
                <previewDialImmediately>?</previewDialImmediately>
                <!--Optional:-->
                <useTelemarketingMaxQueTimeEq1>?</useTelemarketingMaxQueTimeEq1>
            </campaign>
        </ser:createOutboundCampaign>
    </soapenv:Body>
</soapenv:Envelope>